const File = require('../models/FileModel'); // File 모델 임포트

// 형용사 데이터셋
const adjectives = ['가냘픈', '가는', '가엾은', '가파른', '같은', '거센', '거친', '검은', '게으른', '고달픈', '고른', '고마운', '고운', '고픈', '곧은', '괜찮은', '구석진', '굳은', '굵은', '귀여운', '그런', '그른', '그리운', '기다란', '기쁜', '긴', '깊은', '깎아지른', '깨끗한', '나쁜', '나은', '난데없는', '날랜', '날카로운', '낮은', '너그러운', '너른', '널따란', '넓은', '네모난', '노란', '높은', '누런', '눅은', '느닷없는', '느린', '늦은', '다른', '더러운', '더운', '덜된', '동그란', '돼먹잖은', '된', '둥그런', '둥근', '뒤늦은', '드문', '딱한', '때늦은', '뛰어난', '뜨거운', '막다른', '많은', '매운', '먼', '멋진', '메마른', '메스꺼운', '모난', '못난', '못된', '못생긴', '무거운', '무딘', '무른', '무서운', '미끄러운', '미운', '바람직한', '반가운', '밝은', '밤늦은', '보드라운', '보람찬', '부드러운', '부른', '붉은', '비싼', '빠른', '빨간', '뻘건', '뼈저린', '뽀얀', '뿌연', '새로운', '서툰', '섣부른', '설운', '성가신', '센', '수줍은', '쉬운', '스스러운', '슬픈', '시원찮은', '싫은', '싼', '쌀쌀맞은', '쏜살같은', '쓰디쓴', '쓰린', '쓴', '아니꼬운', '아닌', '아름다운', '아쉬운', '아픈', '안된', '안쓰러운', '안타까운', '않은', '알맞은', '약빠른', '약은', '얇은', '얕은', '어두운', '어려운', '어린', '언짢은', '엄청난', '없는', '여문', '열띤', '예쁜', '올바른', '옳은', '외로운', '우스운', '의심스런', '이른', '익은', '있는', '작은', '잘난', '잘빠진', '잘생긴', '재미있는', '적은', '젊은', '점잖은', '조그만', '좁은', '좋은', '주제넘은', '줄기찬', '즐거운', '지나친', '지혜로운', '질긴', '짓궂은', '짙은', '짠', '짧은', '케케묵은', '큰', '탐스러운', '턱없는', '푸른', '한결같은', '흐린', '희망찬', '흰', '힘겨운'];

// 동물 이름 명사 데이터셋
const animalNouns = ['고양이', '강아지', '거북이', '토끼', '뱀', '사자', '호랑이', '표범', '치타', '하이에나', '기린', '코끼리', '코뿔소', '하마', '악어', '펭귄', '부엉이', '올빼미', '곰', '돼지', '소', '닭', '독수리', '타조', '고릴라', '오랑우탄', '침팬지', '원숭이', '코알라', '캥거루', '고래', '상어', '칠면조', '직박구리', '쥐', '청설모', '메추라기', '앵무새', '삵', '스라소니', '판다', '오소리', '오리', '거위', '백조', '두루미', '고슴도치', '두더지', '아홀로틀', '맹꽁이', '너구리', '개구리', '두꺼비', '카멜레온', '이구아나', '노루', '제비', '까치', '고라니', '수달', '당나귀', '순록', '염소', '공작', '바다표범', '들소', '박쥐', '참새', '물개', '바다사자', '살모사', '구렁이', '얼룩말', '산양', '멧돼지', '카피바라', '도롱뇽', '북극곰', '퓨마', '', '미어캣', '코요테', '라마', '딱따구리', '기러기', '비둘기', '스컹크', '돌고래', '까마귀', '매', '낙타', '여우', '사슴', '늑대', '재규어', '알파카', '양', '다람쥐', '담비'];

// 식물 이름 명사 데이터셋
const plantNouns = ["가래나무","가문비나무","가시오갈피","가죽나무","갈매나무","갈참나무","감나무","감자나무","감탕나무","개가시나무","개나리","개다래","개박달나무","개비자나무","개살구나무","개암나무","개오동","개옻나무","검은재나무","계수나무","고욤나무","곰솔","곰의말채나무","광나무","광대싸리","구상나무","굴거리나무","굴참나무","굴피나무","귀룽나무","기름밤나무","꽃개오동","꽃개회나무","꽝꽝나무","꾸지나무","나도밤나무","나래쪽동백","낙상홍","너도밤나무","노간주나무","노박덩굴","녹나무","누리장나무","눈잣나무","눈측백","느릅나무","느티나무","능금나무","능소화","다래","다릅나무","닥나무","단풍나무","담쟁이덩굴","담팔수","당느릅나무","당버들","댕강나무","돈나무","동백나무","동정귤","두릅나무","두충","들메나무","들쭉나무","등 (식물)","등대꽃나무","때죽나무","떡갈나무","리기다소나무","마가목","만리화","말채나무","망개나무","매발톱나무","매자나무","매화오리나무","머귀나무","머루","먼나무","멀구슬나무","멍석딸기","모감주나무","모란","모람","목련","목서","물오리나무","물푸레나무","미루나무","미선나무","박달나무","박태기나무","밤나무","배롱나무","백리향 (종)","백송","버드나무","벚나무 (종)","벽오동","병귤","병꽃나무","병아리꽃나무","보리밥나무","보리수나무","보리장나무","복분자딸기","복숭아","복자기","부용","분꽃나무","분비나무","붉가시나무","붉은병꽃나무","붓순나무","비목나무","비술나무","비자나무","빈귤","빈도리","뽕나무","사두감","사스래나무","사스레피나무","사시나무","사위질빵","사철나무","산딸기","산딸나무","산벚나무","산수유","산앵도나무","산초나무","산팽나무"];

// 랜덤 키 생성 함수
function generateRandomKey() {
    // 형용사와 명사 데이터셋을 랜덤으로 선택
    const adjective = adjectives[Math.floor(Math.random() * adjectives.length)];
    const noun = Math.random() < 0.5 ? animalNouns[Math.floor(Math.random() * animalNouns.length)] : plantNouns[Math.floor(Math.random() * plantNouns.length)];

    // 형용사와 명사 조합 반환
    return adjective + noun;
}

// 고유한 키를 생성하는 함수
async function generateUniqueKey() {
    let key;
    let isUnique = false;

    while (!isUnique) {
        key = generateRandomKey(); // 임의의 키 생성 함수 호출

        // 데이터베이스에서 해당 키를 가진 파일 검색
        const fileWithKey = await File.findOne({ key: key });

        // 중복되지 않은 키를 찾을 때까지 반복
        if (!fileWithKey) {
            isUnique = true;
        }
    }

    return key;
}

module.exports = generateUniqueKey;